
/**
*  https://morsecode.world/international/morse.html 
**/
const prosign = {
  ".-.-.": "[End of message]",
  ".-.-": "[New line]",
  ".-...": "[wait]",
  "-...-.-": "[Break]",
  "-...-": "[New Paragraph]",
  "-.-..-..": "[Going off the air]",
  "-.-.-": "[Start copying]",
  "-.-.-": "[Starting signal]",
  "-.--.": "[Please transmit]",
  "...-.-": "[End of transmission]",
  "---.-": "[Understood]",
  "...---...": "[SOS]"
}

const base = {
		".-": "a",
		"-...": "b",
		"-.-.": "c",
		"-..": "d",
		".": "e",
		"..-.": "f",
		"--.": "g",
		"....": "h",
		"..": "i",
		".---": "j",
		"-.-": "k",
		".-..": "l",
		"--": "m",
		"-.": "n",
		"---": "o",
		".--.": "p",
		"--.-": "q",
		".-.": "r",
		"...": "s",
		"-": "t",
		"..-": "u",
		"...-": "v",
		".--": "w",
		"-..-": "x",
		"-.--": "y",
		"--..": "z",
		".-.-.-": ".",
		"--..--": ",",
		"..--..": "?",
		".----.": "'",
		".-..-.": "\"",
		"-.-.--": "!",
		"-..-.": "/",
		"---...": ":",
		"-.-.-.": ";",
		"-.--.": "(",
		"-.--.-": ")",
		"-...-": "=",
		"-....-": "-",
		"..--.-": "_",
		".-.-.": "+",
		".--.-.": "@",
		".----": "1",
		"..---": "2",
		"...--": "3",
		"....-": "4",
		".....": "5",
		"-....": "6",
		"--...": "7",
		"---..": "8",
		"----.": "9",
		"-----": "0",
}

const international = {
	name: "international",
  short_name: "",
	table: {
    ...base,
	}
}

const russian = {
  name: "russian",
  short_name: "RU",
  table: {
		".-": "a",
		"-...": "б",
		".--": "в",
		"--.": "г",
		"-..": "д",
		".": "е",
		"...-": "ж",
		"--..": "з",
		"..": "и",
		".---": "й",
		"-.-": "к",
		".-..": "л",
		"--": "м",
		"-.": "h",
		"---": "о",
		".--.": "п",
		".-.": "p",
		"...": "с",
		"-": "т",
		"..-": "у",
		"..-.": "ф",
		"....": "х",
		"-.-.": "ц",
		"---.": "ч",
		"----": "ш",
		"--.-": "щ",
		"-..-": "ь",
		"-.--": "ы",
		"..-..": "э",
		"..--": "ю",
		".-.-": "я",
		
		"......": ".",
		".-.-.-": ",",
		"..--..": "?",
		".----.": "'",
		".-..-.": "\"",
		"--..--": "!",
		"-..-.": "/",
		"---...": ":",
		"-.-.-": ";",
		"-.--.-": ")",
		"-...-": "=",
		"-....-": "-",
		"-...-": "-",
		"..--.-": "_",
		".-.-.": "+",
		".--.-.": "@",
		".----": "1",
		"..---": "2",
		"...--": "3",
		"....-": "4",
		".....": "5",
		"-....": "6",
		"--...": "7",
		"---..": "8",
		"----.": "9",
    "-----": "0",  
  }
}


/**
https://morsecode.world/international/morse.html
À Å 	.--.-
Ä Ą Æ 	.-.-
Ć Ĉ Ç 	-.-..
Ch Ĥ Š 	----
ĐÉĘ 	..-..
Ð 	..--.
È Ł 	.-..-
Ĝ 	--.-.
Ĵ 	.---.
Ń Ñ 	--.--
Ó Ö Ø 	---.
Ś 	...-...
Ŝ 	...-.
Þ 	.--..
Ü Ŭ 	..--
Ź 	--..-.
Ż 	--..-
**/
const extended = {
	name: "european extended",
  short_name: "EU",
	table: {
    ...base,
    ".--.-": "[àå]",
    ".-.-": "[äąæ]",
    "-.-..": "[ćĉç]",
    "----": "[hĥš]",
    "..-..": "[đéę]",
    "..--.": "ð",
    ".-..-": "[èł]",
    "--.-.": "ĝ",
    ".---.": "ĵ",
    "--.--": "[ńñ]",
    "---.": "[óöø]",
    "...-...": "ś",
    "...-.": "ŝ",
    ".--..": "þ",
    "..--": "[üŭ]",
    "--..-.": "ź",
    "--..-": "ż",
	}
}

/**
* This is temporary
*
* TODO: integrate prosigns in all dialects, with a custom gui.
* This implementation of prosigns is kinda useless
**/
const temp_prosign = {
	name: "prosign only",
  short_name: "PRO",
	table: {
    ...prosign,
	}
}

export const dialects = {
	international,
  russian,
  extended,
  temp_prosign
}

export default function getDialect(dialect){
	if(dialects.hasOwnProperty(dialect)){
		return dialects[dialect]
	}else{
		return dialects["international"]
	}
}
